/**
 *
 *     Реализовать подобие интернет-магазина.
            В левой части страницы - перечень категорий.
            При клике на категорию выводится список товаров этой категории.
            Клик на товар - информацию о товаре.
            В информации товара - кнопка “купить”
            При клике на “купить” появляется уведомление,
            что товар куплен и возврат в исходное состояние приложения
            (когда отображается только список категорий)
 *
 **/

const box = document.getElementById('box')
console.log(999)