/**************************************************************************************
 *
 *           3.
 *           Дано целое число.
 *           Вывести все целые числа от 1 до 100, квадрат которых не превышает числа N
 *
 ************************************************************************************** */
const num = Math.floor(prompt('Введите целое число', 10))

const box = document.getElementById('box')
const start = 1
const end = 100
let arr = []

for(let i = start; i <= end; i++){
    if(i*i <= num){
        arr.push(i)
    }
}
document.write(`</br>`)
box.innerHTML = `Ваше цисло:  ${num}`
box.innerHTML = `Квадрат чисел: </br> ${arr} </br> не превышает цисла: </br> <h4>${num} </h4>`

