/**************************************************************************************
 *
 *           1.
 *           Написать функцию, которая принимает 1 параметр.
 *           При первом вызове, она его запоминает,
 *           при втором — суммирует переданный параметр с тем,
 *           что передали первый раз и тд.
 *           Всё это с замыканиями, например: sum(3) = 3 sum(5) = 8 sum(20) = 28
 *
 ************************************************************************************** */

let num
function sum(param){
    if(num){
        num = num + param
    } else {
        num = param
    }
    return num
}
console.log('1', sum(3))
console.log('2', sum(30))
console.log('3', sum(55))
